/*********************************************************************
*数值微分
*********************************************************************/
#include"插值.h"
double num_differ(double*x, double*y, int n, double fx, double stpe);
//离散点数值微分	形参表：x指针，y指针，数据组数，微分点，步长
double num_differ_f(double(*f)(double), double x, double stpe);
//已知解析式的数值微分	形参表：函数指针，微分点，步长
/*********************************************************************
*离散点数值微分
*********************************************************************/
double num_differ(double*x, double*y, int n, double fx, double stpe) {
	double x1 = fx - stpe, x2 = fx + stpe;
	double y1 = Lagrange_x(x, y, x1, n), y2 = Lagrange_x(x, y, x2, n);
	return (y2 - y1) / (x2 - x1);
}
/*********************************************************************
*已知解析式的数值微分
*********************************************************************/
double num_differ_f(double(*f)(double), double x, double stpe) {
	double x1 = x - stpe, x2 = x + stpe;
	double y1 = f(x1), y2 = f(x2);
	return (y2 - y1) / (x2 - x1);
}
/*********************************************************************
*
*********************************************************************/